{
  "vuejs-jp-ug": "Vue.js Japan User Group",
  "logo-text": "Vue.js JP",
  "menu": {
    "home": "Home",
    "about": "About",
    "contact": "Contact",
    "privacy": "Privacy Policy",
    "code-of-conduct": "Code Of Conduct",
    "sitemap": "Sitemap"
  },
  "sitemap": {
    "about": "About Vue.js JP",
    "inquiry": "Inquiry"
  },
  "footer": {
    "copyright": "© 2020 Vue.js Japan Users Group some rights reserved.",
    "license-text": "Released under the {license}.",
    "author-text": "Vue.js artworks by {author} is licensed under a {license}.",
    "site-text": "Proudly created by Vue.js Japan User Group members, powered by {powered}.",
    "deploy": "Deploys by Netlify"
  },
  "components": {
    "HomeHero": {
      "welcome": "Welcome to",
      "japan": "Japan’s largest",
      "community": "Vue.js Community",
      "title": "{welcome} {japan} {community}.",
      "vuefes": "Vue Fes Japan",
      "docs": "translating official Vue.js documentation into Japanese",
      "largest-community": "largest Vue.js community in Japan",
      "text": "Welcome to the Vue.js Japan User Group. {newline}We are the {largest-community},{newline}organizing the annual {vuefes},{newline}{docs},{newline}and contributing to the spread of Vue.js in Japan {newline}and the Vue.js ecosystem."
    },
    "HomeEvents": {
      "heading": "EVENTS",
      "title": "The Vue.js community in Japan is looking forward to meet you.",
      "body1": "Vue.js creator Evan You also participates in Japan largest conference \"Vue Fes Japan\" as well as the regularly held and popular Vue.js user study group, \"v-tokyo Meetup\", and many other events around Japan.",
      "body2": "From the latest Vue.js information including Vue.js 3.0, to amazing tips to make your daily development more fun, to a Drink Up Party with delicious food and fun drinks. So, are you ready to connect with the best of the best?",
      "connpass": "See events"
    },
    "HomeCommunications": {
      "heading": "COMMUNICATIONS",
      "everyone": "Everyone",
      "you": "you",
      "wait": "is waiting",
      "online": "for",
      "title": "Anytime, anywhere, {newline}{everyone} {wait} {online} {you}.",
      "body1": "In the Vue.js Japan User Group Slack, we have over 4,000 members having fun discussions every day. For those of you who have complex questions or just want to discuss things in depth, we've prepared a Japanese category in the Vue Forum.",
      "body2": "Anyone can join now, freely, from anywhere. You will be warmly welcomed by community members from all over Japan.",
      "slack": "Join Slack",
      "forum": "Join Forum",
      "chats": {
        "user1": "Have you seen the Composition API in Vue.js 3 RFC? It's amazing! It looks new. What do you guys think?",
        "user2": "There's a plugin for Vue.js 2 that you can try out. I think I'll try it out and write an article about it.",
        "user3": "It's amazing! I know this is going to be controversial, but I'm really curious to see what happens next!"
      }
    },
    "HomeProjects": {
      "heading": "PROJECTS",
      "title": "Anyone can contribute to the growth of {newline}the Vue.js ecosystem.",
      "nowrap": "documentation.",
      "body": "The Vue.js Japan User Group is contributing to the Vue.js ecosystem through a variety of projects, including translating the official Vue.js {nowrap} No matter how small it is, it can be a big help to everyone.",
      "projects": {
        "vue": {
          "title": "Vue.js{newline}{nowrap}",
          "official": "Official Document Translation",
          "body": "Translating the official Vue.js documentation, which is updated daily, is one of the most important roles of the Vue.js Japan User Group.",
          "link": "Contribute with translation"
        },
        "nuxt": {
          "title": "Nuxt.js{newline}{nowrap}",
          "official": "Official Document Translation",
          "body": "Nuxt.js is getting more and more attention in Japan, why don't you help us bring this cutting-edge front-end framework to the whole of Japan?",
          "link": "Contribute with translation"
        },
        "vuejsjp": {
          "title": "Vue.js JP{newline}{nowrap}",
          "official": "Official Website Development",
          "body": "This website is also being developed with the help of community members. Do you have a good idea? We'd love to hear from you on GitHub.",
          "link": "Contribute with development"
        }
      }
    },
    "HomeNews": {
      "heading": "NEWS",
      "info" :"Information!",
      "kindly": "Please",
      "miss": "miss",
      "title": "{kindlywrap} don't {misswrap} out on {newline}the most accessible Vue.js {infowrap}",
      "body": "The latest information on Vue.js, various events, and news on the activities of the Vue.js Japan User Group are posted on our SNS and blog. Follow us now and keep up with what's happening with Vue.js in Japan!",
      "twitter": "Vue.js JP Official Twitter",
      "note": "Vue.js JP Official Note"
    },
    "HomeAbout": {
      "heading": "ABOUT",
      "title": "It is a community of everyone,{newline}by everyone, {nowrap}",
      "title_nowrap": "for everyone.",
      "body1": "Vue.js is a product with a wide range of community connections, including documentation in various languages, all of which are made possible by the cooperation of volunteers. The Vue.js Japan User Group also places great importance on community connections.",
      "body2": "We believe that we can contribute to the Vue.js community not only in Japan, but also around the world through our various projects and activities to promote Vue.js in Japan.",
      "vuejs-jp": "About Vue.js JP",
      "code-of-conduct": "See Code of Conduct",
      "author": "Linustock",
      "copyright": "Illustration by {author}"
    },
    "HomeSponsors": {
      "heading": "SPONSORS",
      "title": "We are supported by many awesome companies.",
      "body": "We have received a lot of support for the some tools used in the activities of the Vue.js Japan User Group, from day-to-day communication to event organaizing."
    },
    "AboutHero": {
      "vuejs": "Enrich Vue.js",
      "title": "{vuejs} ecosystem for everyone, all over Japan.",
      "text": "Vue.js Japan User Group is the largest Vue.js community in Japan,{newline}supporting everyone who loves Vue.js community in Japan.{newline}We support events in various locations and and document translation projects,{newline}we are working to spread Vue.js throughout Japan,{newline}and Vue.js ecosystem around the world."
    },
    "AboutDescription": {
      "message1": "The Vue.js Japan User Group was founded in May 2015 by kazupon and a group of volunteers. At the time, Vue.js didn't have an ecosystem like Nuxt.js or Vuetify, and the community wasn't very large. Nevertheless, we saw the future in Vue.js simplicity and extensibility, which organize to start the Vue.js community. In the four years since then, as Vue.js has grown, so has our community.",
      "message2": "In 2018, Vue.js creator Evan You visited Japan and held Japan's largest Vue.js conference \"Vue Fes Japan\". Regular Meetup events are now being held not only in Tokyo, but all over Japan, and the Vue.js community in Japan is becoming more and more active.",
      "message3": "The vitality of the Vue.js community is not limited to Japan, with conferences being held all over the world. Not only around the world, but also in Japan, Vue.js is being adopted and implemented in a growing number of fields such as news, e-commerce, and advertising, and we believe that it will continue to grow in the future.",
      "message4": "The Vue.js Japan User Group will continue to work for the development of Vue.js, for all of Japan, and for the world."
    },
    "CookieAgreementPopup": {
      "message": "This website stores cookies and other data to help us with analytics and other purposes. By staying on this website, you agree to the use of these cookies.",
      "format": "For more details, please see {privacy}.",
      "ok": "OK"
    },
    "AppAlert": {
      "close": "Close"
    },
    "ContactForm": {
      "form": {
        "name": {
          "label": "Name",
          "require-input": "Please input a name."
        },
        "email": {
          "require-address": "Please input an email address.",
          "invalid-address": "The format of the email address is incorrect."
        },
        "message": {
          "label": "Details of your inquiry",
          "placeholder": "Please fill in the details of your inquiry.",
          "require-message": "Please input the details of your inquiry."
        },
        "button": "Send"
      },
      "states": {
        "progress": "Your inquiry has been sent...",
        "fail": {
          "title": "Thank you for your inquiry.",
          "text": "Your inquiry has been successfully sent. Our staff will contact you as soon as possible after confirming the contents."
        },
        "success": {
          "title": "Failed to send your inquiry.",
          "text": "We are sorry, but we were unable to send your inquiry. We apologize for the inconvenience, but please try again in a few minutes."
        }
      }
    }
  },
  "pages": {
    "top": "Vue.js Japan User Group is the largest Vue.js community in Japan, orgnaizing the annual large-scale conference \"Vue Fes Japan\", translating Vue.js official documents into Japanese, and contributing to the spread of Vue.js in Japan and the Vue.js ecosystem. We are the largest Vue.js community in Japan.",
    "about": "Vue.js Japan User Group is the largest Vue.js community in Japan, supporting everyone who loves Vue.js. Through local event support and documentation translation projects, we are working to spread the use of Vue.js throughout Japan and contribute to the development of the Vue.js ecosystem around the world.",
    "contact": {
      "title": "We’d loved to {newline}hear {from}",
      "from": "from you.",
      "head": "If you have any questions or concerns about the Vue.js Japan User Group, please feel free to contact us using the form.",
      "lead": "If you have any questions or concerns about the Vue.js Japan User Group, please feel free to contact us using the form.",
      "social": {
        "title": "More feel free to contact",
        "lead": "We also accept inquiries in Slack and Twitter. Please don't hesitate to contact us if you have a concern or a quick question.",
        "slack": "Ask a question in Slack",
        "twitter": "Ask a question in Twitter"
      }
    },
    "privacy": "Please check about how the Vue.js Japan User Group collects, uses, discloses, transfers, and stores your personal information.",
    "code-of-conduct": "Please check to the code of conduct set forth by the Vue.js Japan User Group.",
    "sitemap": "Site map for the Vue.js Japan User Group website is available here."
  }
}